CREATE TABLE member (
  member_id INTEGER PRIMARY KEY AUTOINCREMENT,
  username TEXT NOT NULL,
  money INTEGER NOT NULL,
  gender TEXT,
  job TEXT,
  address TEXT NOT NULL
);

INSERT INTO member
  (username, money, gender, job, address)
VALUES
  -- 동명이인: '김영민' 2명
  ('김영민', 0, 'M', '학생', '서울 강남구'),
  ('김영민', 1000000000, 'F', '디자이너', '부산 수영구'),

  -- 변호사 2명 이상
  ('최수진', 50000, 'F', '변호사', '대전 중구'),
  ('김정환', 10, 'M', '변호사', '부산 해운대구'),

  -- 성별 NULL 처리 2명
  ('이지현', 15000000, NULL, '작가', '경기 수원시'),
  ('이수진', 400000, NULL, '학생', '경북 구미시'),

  -- 기타 데이터
  ('박지영', 800000000, 'F', '의사', '대구 달서구'),
  ('이민호', 200000000, 'M', '회사원', '인천 남동구'),
  ('한예린', 300000000, 'F', '교사', '강원 원주시'),
  ('박민영', 7000000000, 'F', '공무원', '충남 천안시'),
  ('서지원', 1000, 'M', '개발자', '경기 고양시 일산동구'),
  ('이수진', 500000000, 'F', '디자이너', '울산 중구'),
  ('정우성', 10000000000, 'M', '연예인', '광주 서구'),
  ('조재영', 9999999999, 'M', '사업가', '경남 창원시 성산구'),
  ('박준형', 60000000, 'M', '회사원', '전북 전주시 완산구'),
  ('윤서영', 1000, 'F', '주부', '전남 목포시'),
  ('장민서', 100000, 'F', '프리랜서', '충북 청주시 청원구'),
  ('백종현', 5000000000, 'M', '셰프', '제주 제주시'),
  ('오지윤', 999999999, 'F', '간호사', '경남 진주시'),
  ('하도윤', 100000, 'M', '기자', '경북 포항시 남구');
